Revit 2024 API
RebarBarType.StirrupTieBendDiameter Property
 Defines bar and hook bend diameter for rebar whose style is stirrup/tie
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double StirrupTieBendDiameter { get; set; }
Visual Basic
Public Property StirrupTieBendDiameter As Double
	Get
	Set
Visual C++
public:
property double StirrupTieBendDiameter {
	double get ();
	void set (double value);
}
Field Value
 The bar and hook bend diameter for rebar whose style is stirrup/tie
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace